hoffman2011.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-08-24 Wed 03:50 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>The No-U-Turn Sampler: Adaptively Setting Path Lengths in Hamiltonian Monte Carlo</title>
<meta name="author" content="Rémi Louf" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">The No-U-Turn Sampler: Adaptively Setting Path Lengths in Hamiltonian Monte Carlo</h1>
<p>
HMC requires users to specify two parameters:
</p>
<ol class="org-ol">
<li>A step size \(\epsilon\). It is too large the simulation will be inaccurate and lead to poor acceptance rate; too small computation will be wasted.</li>
<li>A number of integration steps \(N\). If it is too small, slow mixing; if it is too large the trajectory can loop back to the original point.</li>
</ol>
<div id="outline-container-org5967e7a" class="outline-2">
<h2 id="org5967e7a">A metric to decide when we've integrated for "long enouh"</h2>
<div class="outline-text-2" id="text-org5967e7a">
<p>
NUTS = extension of HMC that eliminates the need to specify a fixed value of \(N\). The metric used to tell us when we have simulated the dynamics for long enough is the squared distance between the initial position \(\theta\) and current position \(\tilde{\theta}\):
</p>

<div class="org-src-container">
<pre class="src src-latex"><span style="font-weight: bold;">\begin</span>{<span style="font-weight: bold;">equation</span>}
  <span style="font-weight: bold;">\left</span>(<span style="font-weight: bold;">\tilde</span>{<span style="font-weight: bold;">\theta</span>} = <span style="font-weight: bold;">\theta</span>)^{2}
<span style="font-weight: bold;">\end</span>{<span style="font-weight: bold;">equation</span>}
</pre>
</div>

<p>
It derivative is given by:
</p>

<div class="org-src-container">
<pre class="src src-latex"><span style="font-weight: bold;">\begin</span>{<span style="font-weight: bold;">equation</span>}
  <span style="font-weight: bold;">\left</span>(<span style="font-weight: bold;">\tilde</span>{<span style="font-weight: bold;">\theta</span>} - <span style="font-weight: bold;">\theta</span>) <span style="font-weight: bold;">\dot</span> <span style="font-weight: bold;">\tilde</span>{r}
<span style="font-weight: bold;">\end</span>{<span style="font-weight: bold;">equation</span>}
</pre>
</div>

<p>
where \(\tilde{r}\) is the current momentum. The idea is to run the integrator until the above quantity becomes negative. \However, this algorithm is not guaranteed to converge./
</p>
</div>
</div>


<div id="outline-container-org9a79251" class="outline-2">
<h2 id="org9a79251">The NUTS algorithm</h2>
<div class="outline-text-2" id="text-org9a79251">
<p>
Let \(\mathcal{B}\) be the set of states that the integrator traces out during a NUTS iteration, and \(\mathcal{C}\) the subset of those states to which we can transition without violating detailed balance.
</p>
</div>

<div id="outline-container-org3eaef8c" class="outline-3">
<h3 id="org3eaef8c">Theory</h3>
</div>

<div id="outline-container-org988b609" class="outline-3">
<h3 id="org988b609">An algorithm that satisfies the constraints</h3>
</div>
<div id="outline-container-org7528822" class="outline-3">
<h3 id="org7528822">A more sophisticated algoritm</h3>
</div>
</div>

<div id="outline-container-org9c39f53" class="outline-2">
<h2 id="org9c39f53">Links to this note</h2>
</div>
</div>
</body>
</html>
